In [7]:
import numpy as np

In [8]:
import pandas as pd

In [12]:
s = pd.Series(np.random.randn(5), index = ["a", "b", "c", "d", "e"])

In [20]:
s

a    0.454259
b   -1.587229
c   -0.220645
d   -1.729887
e   -0.010180
dtype: float64

In [17]:
s.a

0.4542591418789833

In [19]:
s.c

-0.22064538405789721

In [21]:
s[:3]

a    0.454259
b   -1.587229
c   -0.220645
dtype: float64

In [23]:
s[[1,2,3]]

b   -1.587229
c   -0.220645
d   -1.729887
dtype: float64

In [4]:
4+2

6

In [9]:
d = {
        "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
        "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
   }

In [12]:
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [15]:
df = pd.DataFrame(d)

In [16]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [24]:
df["one"]

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [37]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [40]:
df.loc["a"]

one    1.0
two    1.0
Name: a, dtype: float64

In [42]:
df.iloc[2]

one    3.0
two    3.0
Name: c, dtype: float64

In [43]:
df = pd.DataFrame(
        {
            "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
            "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
            "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
        }
    )

In [45]:
df

        one       two     three
a -1.089695 -0.165639       NaN
b  0.265937  0.316624 -0.555650
c  1.054343  1.733140  0.450530
d       NaN  0.803379 -0.912195

In [47]:
df.iloc[1]

one      0.265937
two      0.316624
three   -0.555650
Name: b, dtype: float64

In [53]:
df.sub(df.iloc[1], axis = 1
    )

        one       two     three
a -1.355632 -0.482262       NaN
b  0.000000  0.000000  0.000000
c  0.788406  1.416517  1.006180
d       NaN  0.486756 -0.356545

In [54]:
df.sub(df["two"], axis = 0)

        one  two     three
a -0.924056  0.0       NaN
b -0.050687  0.0 -0.872273
c -0.678797  0.0 -1.282610
d       NaN  0.0 -1.715574